---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroManager.GetMacroManager(Autodesk.Revit.ApplicationServices.Application)
source: html/b4f96c52-afc8-6b22-186b-8e485d0ea7c1.htm
---
# Autodesk.Revit.DB.Macros.MacroManager.GetMacroManager Method

Gets the Macro manager from the application.

## Syntax (C#)
```csharp
public static MacroManager GetMacroManager(
	Application application
)
```

## Parameters
- **application** (`Autodesk.Revit.ApplicationServices.Application`) - The application.

## Returns
The new Macro manager object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null